app/channels/application_cable/connection.rb

    def find_verified_user
      user_id = request.session[:user_id]
      User.find(user_id) if user_id
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]