api/app/models/favorite.rb

  def save_notification
    @notification.set_favorite(self)
    @notification.save
---
INSERT INTO "notifications" ("favorite_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["favorite_id", 1], ["user_id", 1], ["created_at", "2021-03-18 12:07:28.993793"], ["updated_at", "2021-03-18 12:07:28.993793"]]