api/app/models/user.rb

INSERT INTO "users" ("provider", "uid", "name", "nickname", "image", "email", "created_at", "updated_at", "token", "refresh_token", "expires_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
SELECT "users".* FROM "users" WHERE "users"."provider" = ? AND "users"."uid" = ? ORDER BY "users"."id" ASC LIMIT ?  [["provider", "discord"], ["uid", "495119539462209536"], ["LIMIT", 1]]
---
  def self.find_for_oauth(auth)
    puts auth.to_json
    puts auth.info.name
    Rails.logger.warn '----------------------'
    return User.where(provider: auth.provider, uid: auth.uid).first_or_create do |user|

INSERT INTO "user_settings" ("user_id", "setting", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["setting", "{\"selectedTagIds\":[],\"postTagIds\":[]}"], ["created_at", "2021-03-18 00:45:25.108294"], ["updated_at", "2021-03-18 00:45:25.108294"]]
---
  def create_default_user_setting()
    default_user_setting = Rails.configuration.x.preferences['default_user_setting']
    build_user_setting(setting: default_user_setting).save