app/helpers/authentication_helper.rb

  def current_user
    return @current_user if @current_user
    begin
      if session[:user_id]
        # Use session
        @current_user ||= User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]