app/controllers/api/v1/notifications_controller.rb

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 20], ["OFFSET", 0]]
---
    def index
        limit = post_index_params['limit'] || Rails.application.config.x.preferences['page_size']
        offset = post_index_params['offset'] || 0
        @notifications = Notification.where(user: @current_user).includes({favorite: { post: {} }, user: {}}).limit(limit).offset(offset)