app/controllers/api/v1/posts_controller.rb

  def index
    limit = post_index_params['limit'] || Rails.application.config.x.preferences['page_size']
    offset = post_index_params['offset'] || 0
    @posts = Post.left_joins(:taggings).where(taggings: {tag_id: post_index_params['tag']})
      .or(Post.left_joins(:taggings).where(Tagging.arel_table[:tag_id].eq(nil)))
      .distinct().order(created_at: "DESC").limit(limit).offset(offset)
---
SELECT DISTINCT "posts".* FROM "posts" LEFT OUTER JOIN "taggings" ON "taggings"."post_id" = "posts"."id" WHERE ("taggings"."tag_id" IN (?, ?) OR "taggings"."tag_id" IS NULL) ORDER BY "posts"."created_at" DESC LIMIT ? OFFSET ?  [[nil, 2], [nil, 3], ["LIMIT", 20], ["OFFSET", 0]]

  def create
    @post = Post.new(post_params)
    @post.user_id = @current_user.id

    if @post.color == nil
      color = RGB::Color.from_rgb_hex(0xFFCFCF)
      color.h = rand * 360
      @post.color = color.to_rgb_hex
    end

    if @post.save
---
INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at", "color", "raw_content") VALUES (?, ?, ?, ?, ?, ?)  [["content", "😘"], ["user_id", 1], ["created_at", "2021-03-18 00:45:50.789657"], ["updated_at", "2021-03-18 00:45:50.789657"], ["color", "#CFF7FF"], ["raw_content", "😘"]]

  def destroy
    if @post.user == @current_user
      @post.destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]