app/controllers/api/v1/posts_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
  def create
    tags = Tag.where(id: post_params['tag_ids'])