app/controllers/api/v1/user_settings_controller.rb

UPDATE "user_settings" SET "setting" = ?, "updated_at" = ? WHERE "user_settings"."id" = ?  [["setting", "{\"selectedTagIds\":[1],\"postTagIds\":[]}"], ["updated_at", "2021-03-18 00:45:50.743830"], ["id", 1]]
---
  def update
    if @user_setting.update(user_setting_params)

INSERT INTO "user_settings" ("user_id", "setting", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["setting", "{\"selectedTagIds\":[],\"postTagIds\":[]}"], ["created_at", "2021-03-18 00:45:25.108294"], ["updated_at", "2021-03-18 00:45:25.108294"]]
---
    def set_user_setting
      current_api_v1_user.create_default_user_setting unless current_api_v1_user.user_setting