api/app/channels/post_channel.rb

SELECT "tags".* FROM "tags" WHERE "tags"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def subscribed
    tag = Tag.find(tag_id)