api/app/controllers/api/v1/favorites_controller.rb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ?  [["post_id", 12], ["user_id", 1]]
INSERT INTO "favorites" ("user_id", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["post_id", 12], ["created_at", "2021-03-18 12:07:28.987302"], ["updated_at", "2021-03-18 12:07:28.987302"]]
---
    def create
        return head 409 if @post.favorites.where(user: @current_user).count > 0

        favorite = @post.favorites.build(user: @current_user)


        if favorite.save

SELECT "favorites".* FROM "favorites" WHERE "favorites"."post_id" = ? AND "favorites"."user_id" = ? ORDER BY "favorites"."id" ASC LIMIT ?  [["post_id", 12], ["user_id", 1], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 1]]
---
    def destroy
        favorite = @post.favorites.where(user: @current_user).first

        return head :not_found unless favorite

        if favorite.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
    def set_post
        @post = Post.find(favorite_params[:post_id])