api/app/controllers/api/v1/tags_controller.rb

  def index
    @tags = Tag.all.order(created_at: "DESC")
---
SELECT "tags".* FROM "tags" ORDER BY "tags"."created_at" DESC

  def create
    @tag = Tag.new(tag_params)
    @tag.created_by = @current_user

    if @tag.color == nil
      color = RGB::Color.from_rgb_hex(0xFFCFCF)
      color.h = rand * 360
      @tag.color = color.to_rgb_hex
      puts color
    end

    puts @tag.as_json

    if @tag.save
---
INSERT INTO "tags" ("name", "color", "created_by_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "今日のうんこ"], ["color", "#C62222"], ["created_by_id", 1], ["created_at", "2021-03-18 00:45:39.217605"], ["updated_at", "2021-03-18 00:45:39.217605"]]