app/models/token.rb

INSERT INTO "tokens" ("user_id", "uuid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["uuid", "af349de0-1bac-4db4-a044-1a43fbbded6d"], ["created_at", "2021-03-18 00:45:24.824381"], ["updated_at", "2021-03-18 00:45:24.824381"]]
---
  def self.issue(user)
    t = self.new(user: user)
    t.generate_uuid
    t.save!